---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType
source: html/111f4f79-f802-7add-41c0-e51e062ed832.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType

The EnergyAnalysisWindowType class contains window type data for gbXml export.

## Syntax (C#)
```csharp
public class EnergyAnalysisWindowType : Element
```